verilog_defaults -push
verilog_defaults -add -defer
read_verilog /mnt/Coding/litex/pythondata-cpu-vexriscv/pythondata_cpu_vexriscv/verilog/VexRiscv_IMACDebug.v
read_verilog /home/jschiefer/Code/litex-rusty/litex-rusty-app/build/radiona_ulx3s_custom/gateware/radiona_ulx3s_custom.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top radiona_ulx3s_custom
write_json  radiona_ulx3s_custom.json